vagran/pulse/examples/nrf52840/app/main.cpp
#include <uart.h>

#include <pulse/port.h>
#include <pulse/timer.h>
#include <pulse/malloc.h>
#include <pulse/log.h>
#include <pulse/discard_queue.h>

#include <nrf52840.h>
#include <nrfx.h>
#include <nrf_gpio.h>
#include <nrfx_gpiote.h>
#include <nrfx_clock.h>
#include <nrfx_rtc.h>
#include <nrf_power.h>


using namespace pulse;


[[noreturn]] void
Panic(const char *msg)
{
    DisableIrq();

    uart.PanicFlush();

    for (const char *p = msg; *p; p++) {
        uart.WriteCharSync(*p);
    }
    uart.WriteCharSync('\n');

    /* Stop in debug build, reset after delay in release build. */
#ifdef DEBUG
    for(;;);
#else
    /* Make delay before reset */
    NRFX_DELAY_US(500000);

    NVIC_SystemReset();
#endif
}

void
MallocLock()
{
    EnterCriticalSection();
}

void
MallocUnlock()
{
    ExitCriticalSection();
}

void
LogPutc(char c)
{
    uart.WriteChar(c);
}

size_t
LogGetTimestamp(char *buffer, size_t bufferSize)
{
    uint32_t tick = Timer::GetTime();
    ldiv_t r = ldiv(tick, pulseConfig_TICK_FREQ);
    pulse::fmt::BufferOutputStream stream(buffer, bufferSize);
    return pulse::fmt::FormatTo(stream, "{:7}.{:03}", r.quot, r.rem);
}

namespace {

MallocUnit heap[PULSE_HEAP_UNITS_SIZE_KB(10)];

struct GpioLine {
    uint32_t pin;
};

#define DEF_IO(port, pin) NRF_GPIO_PIN_MAP(port, pin)

constexpr GpioLine
    ioLed       DEF_IO(0, 15),
    ioButton    DEF_IO(0, 17);
    // ioRotEncA   DEF_IO(0, 6),
    // ioRotEncB   DEF_IO(0, 8);

/// Configure UICR_REGOUT0 register to set GPIO output voltage to 2.7V. Setting 3.0V makes OpenOCD
/// with FT232H unable to upload firmware.
void
GpioOutputVoltageSetup(void)
{
    uint32_t targetVoltage = UICR_REGOUT0_VOUT_2V7;
    // Configure UICR_REGOUT0 register only if it is set to default value.
    if ((NRF_UICR->REGOUT0 & UICR_REGOUT0_VOUT_Msk) !=
        (targetVoltage << UICR_REGOUT0_VOUT_Pos)) {

        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

        NRF_UICR->REGOUT0 = (NRF_UICR->REGOUT0 & ~((uint32_t)UICR_REGOUT0_VOUT_Msk)) |
                            (targetVoltage << UICR_REGOUT0_VOUT_Pos);

        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

        // System reset is needed to update UICR registers.
        NVIC_SystemReset();
    }
}

void
RtcInterruptHandler(nrfx_rtc_int_type_t intType)
{
    if (intType == nrfx_rtc_int_type_t::NRFX_RTC_INT_TICK) {
        pulse::Timer::Tick();
    }
}

void
ClockEventsHandler(nrfx_clock_evt_type_t)
{}

nrfx_rtc_t rtc0 = NRFX_RTC_INSTANCE(0);

void
InitTicks()
{
    if (nrfx_clock_init(ClockEventsHandler) != NRFX_SUCCESS) {
        Panic("Clock init failed");
    }
    nrfx_clock_enable();
    nrfx_clock_lfclk_start();

    nrfx_rtc_config_t config = {
        .prescaler = RTC_FREQ_TO_PRESCALER(pulseConfig_TICK_FREQ),
        .interrupt_priority = NRFX_RTC_DEFAULT_CONFIG_IRQ_PRIORITY,
        .tick_latency       = 1,
        .reliable           = NRFX_RTC_DEFAULT_CONFIG_RELIABLE
    };
    if (nrfx_rtc_init(&rtc0, &config, RtcInterruptHandler) != NRFX_SUCCESS) {
        Panic("RTC init failed");
    }

    nrfx_rtc_tick_enable(&rtc0, true);
    nrfx_rtc_enable(&rtc0);
}

void
InitLed()
{
    nrf_gpio_cfg(
        ioLed.pin,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_NOPULL,
        NRF_GPIO_PIN_D0H1,
        NRF_GPIO_PIN_NOSENSE);
}

Timer blinkTimer;
int blinkIntervalIndex = 0;
// Published from the button ISR, `true` for pressed event, `false` for release.
InlineDiscardQueue<bool, true, 8> buttonEvents;

bool
IsButtonPressed()
{
    return !nrf_gpio_pin_read(ioButton.pin);
}

void
PinStateHandler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    if (pin == ioButton.pin) {
        // May produce wrong value on fast bouncing. However last release will always be detected as
        // release.
        buttonEvents.Push(IsButtonPressed());
    }
}

void
InitButton()
{
    if (nrfx_gpiote_init() != NRFX_SUCCESS) {
        Panic("GPIOTE init failed");
    }

    nrfx_gpiote_in_config_t config = NRFX_GPIOTE_CONFIG_IN_SENSE_TOGGLE(true);
    config.pull = NRF_GPIO_PIN_PULLUP;

    if (nrfx_gpiote_in_init(ioButton.pin, &config, PinStateHandler) != NRFX_SUCCESS) {
        Panic("Pin init failed");
    }

    nrfx_gpiote_in_event_enable(ioButton.pin, true);
}

void
LedOn()
{
    nrf_gpio_pin_set(ioLed.pin);
}

void
LedOff()
{
    nrf_gpio_pin_clear(ioLed.pin);
}

void
LedToggle()
{
    nrf_gpio_pin_toggle(ioLed.pin);
}

Awaitable<void>
ConfirmSwitch(int intervalIndex)
{
    LedOff();
    co_await Timer::Delay(etl::chrono::milliseconds(500));
    for (int i = 0; i <= intervalIndex; i++) {
        LedOn();
        co_await Timer::Delay(etl::chrono::milliseconds(100));
        LedOff();
        co_await Timer::Delay(etl::chrono::milliseconds(200));
    }
    co_await Timer::Delay(etl::chrono::milliseconds(500));
}

// Handles LED blinking
TaskV
BlinkTask()
{
    int intervalIndex = blinkIntervalIndex;

    while (true) {
        if (intervalIndex != blinkIntervalIndex) {
            intervalIndex = blinkIntervalIndex;
            co_await ConfirmSwitch(intervalIndex);
            LedOn();
            continue;
        }
        blinkTimer.ExpiresAfter(etl::chrono::milliseconds(250 << intervalIndex));
        if (!co_await blinkTimer) {
            // Timer cancelled, so interval is definitely changed
            intervalIndex = blinkIntervalIndex;
            co_await ConfirmSwitch(intervalIndex);
            LedOn();
        } else {
            LedToggle();
        }
    }
}

// Handles button debouncing
TaskV
ButtonTask()
{
    constexpr auto JITTER_DELAY = etl::chrono::milliseconds(50);
    Timer jitterTimer;

    while (true) {
        // Wait for press
        while (!co_await buttonEvents.Pop());

        // Do action here. In case long presses supported, should differentiate from long press
        // first.
        blinkIntervalIndex++;
        if (blinkIntervalIndex > 3) {
            blinkIntervalIndex = 0;
        }
        blinkTimer.Cancel();

        LOG_INFO("New interval: {}", blinkIntervalIndex);

        MallocStats stats;
        pulse::GetMallocStats(&stats);
        uart.Format("Total free: {}\n", stats.totalFree);
        uart.Format("Total used: {}\n", stats.totalUsed);
        uart.Format("Min free: {}\n", stats.minFree);
        uart.Format("Blocks allocated: {}\n", stats.numBlocksAllocated);

        // Suppress jitter - wait until inactive level is stable for a long period
        bool isPressed = true;
        while (true) {
            jitterTimer.ExpiresAfter(JITTER_DELAY);
            size_t idx = co_await Task::WhenAny(
                Task::SaveResult(buttonEvents.Pop(), isPressed), jitterTimer);
            if (idx == 0) {
                // Button toggled again, restart anti-jitter delay
                continue;
            }
            // Anti-jitter delay expired with no new toggles
            break;
        }
        if (!isPressed) {
            // Release debounced
            continue;
        }

        // Potential long press, not handled currently, just debounce release
        while (true) {
            // Wait for release
            while (co_await buttonEvents.Pop());

            // Suppress release jitter
            bool isPressed = false;
            while (true) {
                jitterTimer.ExpiresAfter(JITTER_DELAY);
                size_t idx = co_await Task::WhenAny(
                    Task::SaveResult(buttonEvents.Pop(), isPressed), jitterTimer);
                if (idx == 0) {
                    continue;
                }
                // Anti-jitter delay expired with no new toggles
                break;
            }
            if (!isPressed) {
                // Release debounced
                break;
            }
            // Long press continues
        }
    }
}

} // anonymous namespace


extern "C" [[noreturn]] int
main()
{
    GpioOutputVoltageSetup();

    pulse_add_heap_region(heap, sizeof(heap));

    static uint8_t uartBuffer[1024];
    uart.Initialize(NRF_UART_BAUDRATE_230400, uartBuffer, sizeof(uartBuffer));

    LOG_INFO("Application started - " PULSE_STR(BUILDER));

    InitTicks();

    InitLed();
    InitButton();

    Task::Spawn(BlinkTask()).Pin();
    Task::Spawn(ButtonTask()).Pin();

    Task::RunScheduler();

    Panic("Scheduler exited");
}

extern "C" void
_init()
{}

extern "C" void
_fini()
{}

// Prevent memory wasting for libc atexit.
extern "C" int
__wrap_atexit(void (*)())
{
    return -1;
}
